Layer (type)                 Output Shape              Param #   
=================================================================
flat_conv_a (Conv2D)         (None, None, None, 24)    240       
_________________________________________________________________
flat_conv_b (Conv2D)         (None, None, None, 24)    5208      
_________________________________________________________________
down_conv_1 (Conv2D)         (None, None, None, 24)    5208      
_________________________________________________________________
dropout_1 (Dropout)          (None, None, None, 24)    0         
_________________________________________________________________
flat_conv_1 (Conv2D)         (None, None, None, 64)    13888     
_________________________________________________________________
flat_conv_2 (Conv2D)         (None, None, None, 64)    36928     
_________________________________________________________________
down_conv_2 (Conv2D)         (None, None, None, 64)    36928     
_________________________________________________________________
dropout_2 (Dropout)          (None, None, None, 64)    0         
_________________________________________________________________
flat_conv_3 (Conv2D)         (None, None, None, 128)   73856     
_________________________________________________________________
flat_conv_4 (Conv2D)         (None, None, None, 256)   295168    
_________________________________________________________________
dropout_3 (Dropout)          (None, None, None, 256)   0         
_________________________________________________________________
flat_conv_5 (Conv2D)         (None, None, None, 256)   590080    
_________________________________________________________________
flat_conv_6 (Conv2D)         (None, None, None, 256)   590080    
_________________________________________________________________
dropout_4 (Dropout)          (None, None, None, 256)   0         
_________________________________________________________________
flat_conv_7 (Conv2D)         (None, None, None, 256)   590080    
_________________________________________________________________
flat_conv_8 (Conv2D)         (None, None, None, 128)   295040    
_________________________________________________________________
dropout_5 (Dropout)          (None, None, None, 128)   0         
_________________________________________________________________
up_samp_1 (UpSampling2D)     (None, None, None, 128)   0         
_________________________________________________________________
up_conv_1 (Conv2D)           (None, None, None, 64)    131136    
_________________________________________________________________
dropout_6 (Dropout)          (None, None, None, 64)    0         
_________________________________________________________________
flat_conv_9 (Conv2D)         (None, None, None, 64)    36928     
_________________________________________________________________
flat_conv_10 (Conv2D)        (None, None, None, 64)    36928     
_________________________________________________________________
up_samp_2 (UpSampling2D)     (None, None, None, 64)    0         
_________________________________________________________________
up_conv_2 (Conv2D)           (None, None, None, 24)    24600     
_________________________________________________________________
dropout_7 (Dropout)          (None, None, None, 24)    0         
_________________________________________________________________
flat_conv_11 (Conv2D)        (None, None, None, 12)    2604      
_________________________________________________________________
flat_conv_12 (Conv2D)        (None, None, None, 1)     109       
=================================================================
Total params: 2,765,009
Trainable params: 2,765,009
Non-trainable params: 0
_________________________________________________________________