{"backend": "tensorflow", "class_name": "Model", "keras_version": "2.2.0", "config": {"name": "model_1", "output_layers": [["flat_conv_12", 0, 0]], "layers": [{"inbound_nodes": [], "class_name": "InputLayer", "name": "input_1", "config": {"batch_input_shape": [null, null, null, 1], "name": "input_1", "sparse": false, "dtype": "float32"}}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "flat_conv_a", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "data_format": "channels_last", "activation": "relu", "padding": "same", "strides": [1, 1], "batch_input_shape": [null, null, null, 1], "name": "flat_conv_a", "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "trainable": true, "kernel_size": [3, 3], "filters": 24, "bias_regularizer": null, "dtype": "float32"}}, {"inbound_nodes": [[["flat_conv_a", 0, 0, {}]]], "class_name": "Conv2D", "name": "flat_conv_b", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "strides": [1, 1], "activation": "relu", "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "use_bias": true, "name": "flat_conv_b", "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "kernel_size": [3, 3], "filters": 24, "bias_regularizer": null}}, {"inbound_nodes": [[["flat_conv_b", 0, 0, {}]]], "class_name": "Conv2D", "name": "down_conv_1", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "strides": [2, 2], "activation": "relu", "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "use_bias": true, "name": "down_conv_1", "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "kernel_size": [3, 3], "filters": 24, "bias_regularizer": null}}, {"inbound_nodes": [[["down_conv_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "flat_conv_1", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "strides": [1, 1], "activation": "relu", "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "use_bias": true, "name": "flat_conv_1", "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "kernel_size": [3, 3], "filters": 64, "bias_regularizer": null}}, {"inbound_nodes": [[["flat_conv_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "flat_conv_2", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "strides": [1, 1], "activation": "relu", "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "use_bias": true, "name": "flat_conv_2", "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "kernel_size": [3, 3], "filters": 64, "bias_regularizer": null}}, {"inbound_nodes": [[["flat_conv_2", 0, 0, {}]]], "class_name": "Conv2D", "name": "down_conv_2", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "strides": [2, 2], "activation": "relu", "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "use_bias": true, "name": "down_conv_2", "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "kernel_size": [3, 3], "filters": 64, "bias_regularizer": null}}, {"inbound_nodes": [[["down_conv_2", 0, 0, {}]]], "class_name": "Conv2D", "name": "flat_conv_3", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "strides": [1, 1], "activation": "relu", "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "use_bias": true, "name": "flat_conv_3", "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "kernel_size": [3, 3], "filters": 128, "bias_regularizer": null}}, {"inbound_nodes": [[["flat_conv_3", 0, 0, {}]]], "class_name": "Conv2D", "name": "flat_conv_4", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "strides": [1, 1], "activation": "relu", "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "use_bias": true, "name": "flat_conv_4", "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "kernel_size": [3, 3], "filters": 128, "bias_regularizer": null}}, {"inbound_nodes": [[["flat_conv_4", 0, 0, {}]]], "class_name": "Conv2D", "name": "xx_conv_3", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "strides": [1, 1], "activation": "relu", "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "use_bias": true, "name": "xx_conv_3", "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "kernel_size": [3, 3], "filters": 128, "bias_regularizer": null}}, {"inbound_nodes": [[["xx_conv_3", 0, 0, {}]]], "class_name": "Conv2D", "name": "flat_conv_5", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "strides": [1, 1], "activation": "relu", "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "use_bias": true, "name": "flat_conv_5", "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "kernel_size": [3, 3], "filters": 256, "bias_regularizer": null}}, {"inbound_nodes": [[["flat_conv_5", 0, 0, {}]]], "class_name": "Conv2D", "name": "flat_conv_6", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "strides": [1, 1], "activation": "relu", "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "use_bias": true, "name": "flat_conv_6", "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "kernel_size": [3, 3], "filters": 256, "bias_regularizer": null}}, {"inbound_nodes": [[["flat_conv_6", 0, 0, {}]]], "class_name": "Conv2D", "name": "flat_conv_7", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "strides": [1, 1], "activation": "relu", "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "use_bias": true, "name": "flat_conv_7", "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "kernel_size": [3, 3], "filters": 256, "bias_regularizer": null}}, {"inbound_nodes": [[["flat_conv_7", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_1", "config": {"seed": null, "rate": 0.1, "trainable": true, "name": "dropout_1", "noise_shape": null}}, {"inbound_nodes": [[["dropout_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "xx_conv_0", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "strides": [1, 1], "activation": "relu", "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "use_bias": true, "name": "xx_conv_0", "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "kernel_size": [3, 3], "filters": 128, "bias_regularizer": null}}, {"inbound_nodes": [[["xx_conv_0", 0, 0, {}]]], "class_name": "Conv2D", "name": "flat_conv_8", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "strides": [1, 1], "activation": "relu", "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "use_bias": true, "name": "flat_conv_8", "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "kernel_size": [3, 3], "filters": 128, "bias_regularizer": null}}, {"inbound_nodes": [[["flat_conv_8", 0, 0, {}]]], "class_name": "Conv2D", "name": "flat_conv_8b", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "strides": [1, 1], "activation": "relu", "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "use_bias": true, "name": "flat_conv_8b", "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "kernel_size": [3, 3], "filters": 128, "bias_regularizer": null}}, {"inbound_nodes": [[["flat_conv_8b", 0, 0, {}]]], "class_name": "UpSampling2D", "name": "up_samp_1", "config": {"trainable": true, "size": [2, 2], "name": "up_samp_1", "data_format": "channels_last"}}, {"inbound_nodes": [[["up_samp_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "up_conv_1", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "strides": [1, 1], "activation": "relu", "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "use_bias": true, "name": "up_conv_1", "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "kernel_size": [4, 4], "filters": 64, "bias_regularizer": null}}, {"inbound_nodes": [[["flat_conv_2", 0, 0, {}], ["up_conv_1", 0, 0, {}]]], "class_name": "Concatenate", "name": "concatenate_1", "config": {"trainable": true, "axis": -1, "name": "concatenate_1"}}, {"inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "flat_conv_9", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "strides": [1, 1], "activation": "relu", "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "use_bias": true, "name": "flat_conv_9", "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "kernel_size": [1, 1], "filters": 64, "bias_regularizer": null}}, {"inbound_nodes": [[["flat_conv_9", 0, 0, {}]]], "class_name": "Conv2D", "name": "flat_conv_10", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "strides": [1, 1], "activation": "relu", "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "use_bias": true, "name": "flat_conv_10", "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "kernel_size": [3, 3], "filters": 64, "bias_regularizer": null}}, {"inbound_nodes": [[["flat_conv_10", 0, 0, {}]]], "class_name": "UpSampling2D", "name": "up_samp_2", "config": {"trainable": true, "size": [2, 2], "name": "up_samp_2", "data_format": "channels_last"}}, {"inbound_nodes": [[["up_samp_2", 0, 0, {}]]], "class_name": "Conv2D", "name": "up_conv_2", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "strides": [1, 1], "activation": "relu", "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "use_bias": true, "name": "up_conv_2", "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "kernel_size": [4, 4], "filters": 24, "bias_regularizer": null}}, {"inbound_nodes": [[["flat_conv_b", 0, 0, {}], ["up_conv_2", 0, 0, {}]]], "class_name": "Concatenate", "name": "concatenate_2", "config": {"trainable": true, "axis": -1, "name": "concatenate_2"}}, {"inbound_nodes": [[["concatenate_2", 0, 0, {}]]], "class_name": "Conv2D", "name": "flat_conv_11", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "strides": [1, 1], "activation": "relu", "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "use_bias": true, "name": "flat_conv_11", "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "kernel_size": [1, 1], "filters": 12, "bias_regularizer": null}}, {"inbound_nodes": [[["flat_conv_11", 0, 0, {}]]], "class_name": "Conv2D", "name": "flat_conv_11b", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "strides": [1, 1], "activation": "relu", "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "use_bias": true, "name": "flat_conv_11b", "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "kernel_size": [3, 3], "filters": 12, "bias_regularizer": null}}, {"inbound_nodes": [[["flat_conv_11b", 0, 0, {}]]], "class_name": "Conv2D", "name": "flat_conv_12", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "strides": [1, 1], "activation": "sigmoid", "data_format": "channels_last", "activity_regularizer": null, "padding": "same", "use_bias": true, "name": "flat_conv_12", "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "kernel_size": [3, 3], "filters": 1, "bias_regularizer": null}}], "input_layers": [["input_1", 0, 0]]}}