Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, None, None, 1 0                                            
__________________________________________________________________________________________________
flat_conv_a (Conv2D)            (None, None, None, 2 240         input_1[0][0]                    
__________________________________________________________________________________________________
flat_conv_b (Conv2D)            (None, None, None, 2 5208        flat_conv_a[0][0]                
__________________________________________________________________________________________________
down_conv_1 (Conv2D)            (None, None, None, 2 5208        flat_conv_b[0][0]                
__________________________________________________________________________________________________
flat_conv_1 (Conv2D)            (None, None, None, 6 13888       down_conv_1[0][0]                
__________________________________________________________________________________________________
flat_conv_2 (Conv2D)            (None, None, None, 6 36928       flat_conv_1[0][0]                
__________________________________________________________________________________________________
down_conv_2 (Conv2D)            (None, None, None, 6 36928       flat_conv_2[0][0]                
__________________________________________________________________________________________________
flat_conv_3 (Conv2D)            (None, None, None, 1 73856       down_conv_2[0][0]                
__________________________________________________________________________________________________
flat_conv_4 (Conv2D)            (None, None, None, 1 147584      flat_conv_3[0][0]                
__________________________________________________________________________________________________
xx_conv_3 (Conv2D)              (None, None, None, 1 147584      flat_conv_4[0][0]                
__________________________________________________________________________________________________
flat_conv_5 (Conv2D)            (None, None, None, 2 295168      xx_conv_3[0][0]                  
__________________________________________________________________________________________________
flat_conv_6 (Conv2D)            (None, None, None, 2 590080      flat_conv_5[0][0]                
__________________________________________________________________________________________________
flat_conv_7 (Conv2D)            (None, None, None, 2 590080      flat_conv_6[0][0]                
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, None, None, 2 0           flat_conv_7[0][0]                
__________________________________________________________________________________________________
xx_conv_0 (Conv2D)              (None, None, None, 1 295040      dropout_1[0][0]                  
__________________________________________________________________________________________________
flat_conv_8 (Conv2D)            (None, None, None, 1 147584      xx_conv_0[0][0]                  
__________________________________________________________________________________________________
flat_conv_8b (Conv2D)           (None, None, None, 1 147584      flat_conv_8[0][0]                
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, None, None, 1 0           flat_conv_8b[0][0]               
__________________________________________________________________________________________________
up_samp_1 (UpSampling2D)        (None, None, None, 1 0           dropout_2[0][0]                  
__________________________________________________________________________________________________
up_conv_1 (Conv2D)              (None, None, None, 6 131136      up_samp_1[0][0]                  
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, None, None, 1 0           flat_conv_2[0][0]                
                                                                 up_conv_1[0][0]                  
__________________________________________________________________________________________________
flat_conv_9 (Conv2D)            (None, None, None, 6 8256        concatenate_1[0][0]              
__________________________________________________________________________________________________
flat_conv_10 (Conv2D)           (None, None, None, 6 36928       flat_conv_9[0][0]                
__________________________________________________________________________________________________
dropout_3 (Dropout)             (None, None, None, 6 0           flat_conv_10[0][0]               
__________________________________________________________________________________________________
up_samp_2 (UpSampling2D)        (None, None, None, 6 0           dropout_3[0][0]                  
__________________________________________________________________________________________________
up_conv_2 (Conv2D)              (None, None, None, 2 24600       up_samp_2[0][0]                  
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, None, None, 4 0           flat_conv_b[0][0]                
                                                                 up_conv_2[0][0]                  
__________________________________________________________________________________________________
flat_conv_11 (Conv2D)           (None, None, None, 1 588         concatenate_2[0][0]              
__________________________________________________________________________________________________
flat_conv_11b (Conv2D)          (None, None, None, 1 1308        flat_conv_11[0][0]               
__________________________________________________________________________________________________
dropout_4 (Dropout)             (None, None, None, 1 0           flat_conv_11b[0][0]              
__________________________________________________________________________________________________
flat_conv_12 (Conv2D)           (None, None, None, 1 109         dropout_4[0][0]                  
==================================================================================================
Total params: 2,735,885
Trainable params: 2,735,885
Non-trainable params: 0
__________________________________________________________________________________________________